[
  {
    "company": "Contract",
    "role": "Software Developer (Frontend)",
    "resps": [
      "Tech Stack: Leveraged a comprehensive tech stack, including JavaScript, React, Node.js, Express, and MongoDB, to design and maintain full-stack web applications, ensuring high performance, security, and seamless user interactions.",
      "E-commerce Platform Development: Engineered a fully operational e-commerce website featuring user authentication, a secure shopping cart, and an admin dashboard for managing products and customer data. Implemented a notification system to streamline client communication and expedite requested changes.",
      "AI and Automation Integration: Developed an AI image generator and configured a Gemini AI clone, enhancing user experiences by integrating customizable AI functionalities into various applications, tailored to specific program needs.",
      "Music Streaming Application: Created a fully functional Spotify clone, featuring intuitive music playback controls and an admin interface for managing songs and albums, delivering a comprehensive and engaging music streaming experience.",
      "Performance Monitoring: Designed and implemented a backend system to continuously monitor and optimize the uptime and performance of all user interfaces, ensuring reliability and a superior user experience."
    ],
    "date": "May 2024 - Current"
  },
  {
    "company": "Miracle Signs and Designs",
    "role": "Owner - Operator - Installer- Sales ",
    "resps": [
      "Established and Managed a Successful Sign Company: Built the business from the ground up, overseeing every aspect, including client acquisition, workflow management, and team leadership across large-scale projects in the Southeastern U.S.",
      "Technical Proficiency and Design Expertise: Mastered design software to efficiently manipulate and set up templates for various products, ensuring precision and high-quality outcomes.",
      "Client-Centric Approach: Developed and maintained a dedicated customer base by delivering quality products on time and creating comprehensive advertising strategies that helped new businesses establish their brand.",
      "Leadership in High-Stress Environments: Effectively managed time, resources, and employees under pressure, ensuring cost efficiency while maintaining top-notch quality on all projects.",
      "Overcame Adversity: After contracting Guillain-Barré syndrome and recovering from being wheelchair-bound for over a year, I eventually sold the company and transitioned to a new career path."
    ],
    "date": "Aug 2010 - March 2022"
  }
]
